{
  "sections": {
    "main": {
      "type": "main-page",
      "disabled": true,
      "settings": {
        "content_width": "80ch"
      }
    },
    "40bddd26-22d8-4549-bbe1-7385859f764b": {
      "type": "multi-column",
      "disabled": true,
      "blocks": {
        "template--19176972124466__40bddd26-22d8-4549-bbe1-7385859f764b-1684752358f624e333-0": {
          "type": "item",
          "settings": {
            "image": "shopify:\/\/shop_images\/Picture_1_89e2417d-258a-4d8d-b650-f0636b8a3e04.png",
            "column_size": "2",
            "title": "Movement Overhaul",
            "heading_tag": "h4",
            "content": "<p>Elevate your timekeeping journey today! Through meticulous disassembly, cleaning, lubrication, and reassembly, we restore its accuracy and precision. <\/p><p>Our Movement Overhaul Service entails the<br\/>following steps: <\/p><ul><li>Thorough Disassembly and Inspection: Every<br\/>component of your watch and movement is carefully dismantled and inspected for<br\/>any issues or wear.<\/li><li>Cleaning and Component Replacement: We clean<br\/>the movement components and replace any worn or damaged parts with genuine<br\/>replacements (additional cost may apply).<\/li><li>Precise Reassembly and Calibration: The<br\/>movement is reassembled with utmost precision, ensuring proper oiling of jewels<br\/>and accurate calibration of the timing mechanism.<\/li><li>Case and Bracelet Polishing: Unless otherwise<br\/>instructed, we expertly polish and refinish the case and bracelet, restoring<br\/>their original luster.<\/li><li>Rigorous Quality Control and Testing: Your<br\/>watch undergoes 72 hours of rigorous testing, including timekeeping evaluation,<br\/>water resistance testing to factory specifications, and meticulous visual<br\/>inspection.<\/li><li>One-Year Warranty: Enjoy peace of mind with<br\/>our one-year warranty, ensuring the quality and reliability of our service.<\/li><\/ul>",
            "link_url": "",
            "link_text": "",
            "link_style": "link"
          }
        },
        "template--19176972124466__40bddd26-22d8-4549-bbe1-7385859f764b-1684752358f624e333-1": {
          "type": "item",
          "settings": {
            "image": "shopify:\/\/shop_images\/SCR-20230612-em8.png",
            "column_size": "2",
            "title": "Laser Case Restoration",
            "heading_tag": "h4",
            "content": "<p>Normal polishing methods often result in rounded edges on sharp corners. However, our skilled technicians can restore burred edges to a crisp, precise finish. In essence, we reshape the case to its original form. Please find an overview of our comprehensive case services<br\/>below:<\/p><ul><li>Full Polish: We meticulously polish the entire case, bringing back its brilliant shine and flawless appearance.<\/li><li> Gold Plating: If your watch features gold plating, we offer expert restoration to revive its luxurious and lustrous<br\/>finish.<\/li><li>Case Restoration: Whether it's addressing scratches, scuffs, or otherimperfections, our case restoration service aims to bring back the original beauty and integrity of your watch's case. <\/li><li>Dent Removal: Accidental dents can be skillfully removed, restoring the smoothness and aesthetics of the case.<\/li><li> Laser Welding: In cases of more severe damage or broken parts, our advanced laser welding technique enables precise repairs, ensuring the structural integrity of the case.<\/li><li>Reshaping: If there are issues with the shape or contours of the case, our technicians possess the expertise to reshape and refine it to its original specifications.<\/li><li>Repair Broken Lugs: Broken lugs can be expertly repaired, ensuring the stability and longevity of your watch.<\/li><\/ul>",
            "link_url": "",
            "link_text": "",
            "link_style": "link"
          }
        },
        "template--19176972124466__40bddd26-22d8-4549-bbe1-7385859f764b-1684752358f624e333-2": {
          "type": "item",
          "settings": {
            "image": "shopify:\/\/shop_images\/Picture_1_088e2250-bf36-402a-8b59-21f16f58f3d4.png",
            "column_size": "2",
            "title": "Dial Restoration",
            "heading_tag": "h4",
            "content": "<p>Witness the transformation as your watch regains its captivating allure and legibility, addressing fading, discoloration, and imperfections.<\/p><p>Our dial restoration service is dedicated to<br\/>reviving the captivating allure and legibility of your watch's dial. With<br\/>attention to detail, our skilled technicians address fading, discoloration, and<br\/>imperfections, ensuring a remarkable transformation. Here is an overview of our<br\/>dial restoration services:<\/p><ul><li>Dial Cleaning: We carefully clean the dial, removing accumulated dirt, dust, and other contaminants that may affect its appearance. <\/li><li>Color Restoration: If your dial has faded or lost its original vibrancy, we employ expert techniques to restore its color, bringing it back to its former glory. <\/li><li>Re-Luming: For watches with luminescent markers or hands, we can reapply luminous material, ensuring optimal visibility in low-light conditions. <\/li><li>Dial Refinishing: Scratches, blemishes, or other imperfections on the dial are skillfully addressed through refinishing techniques, resulting in a smooth and flawless surface.<\/li><li>Text and Logo Restoration: Any worn or faded text, logos, or indices on the dial can be meticulously restored to their original sharpness and legibility.<\/li><li>Customization: If desired, we can also assist in adding personalization to the dial, such as custom logos, initials, or special designs, creating a truly unique timepiece.<\/li><\/ul>",
            "link_url": "",
            "link_text": "",
            "link_style": "link"
          }
        },
        "bd14ed58-149e-4374-b8c0-0d85abb24921": {
          "type": "item",
          "settings": {
            "image": "shopify:\/\/shop_images\/Picture_2_42ded568-4136-4a78-85f8-73b6e169e6aa.png",
            "column_size": "2",
            "title": "Battery Replacement",
            "heading_tag": "h4",
            "content": "<p>Don't wait until it's too late! Avoid timekeeping setbacks and keep your watch ticking flawlessly. Power up your timepiece with prompt battery replacements.<\/p><ul><li>Timely Battery Replacement: Don't delay when it comes to replacing your watch battery. Waiting too long can lead to issues with the movement and potential leakage. As soon as you notice a weakening battery, send it to us promptly for replacement.<\/li><li>Replace with Care: At The Repair Hub, we understand that battery replacement requires the same level of care as specialized repairs. We go beyond simply replacing the battery; our comprehensive service includes repairs, maintenance, and routine check-ups to ensure your watch continues to operate at top-notch quality for years to come.<\/li><li>Expertise Required: Changing a watch battery is not as simple as replacing batteries in common appliances. It requires the skill and expertise of a trained professional. Our technicians handle the battery replacement process with precision, ensuring the correct battery type, inspecting surrounding parts for damage or wear, cleaning the area, properly replacing the watch back, and maintaining water resistance, among other essential steps.<\/li><li>Trust the Experts: When it comes to a watch you care about, don't entrust the battery replacement job to just anyone. Rely on our experienced team to provide your watch with the meticulous care and attention it deserves. Let our experts give your watch the treatment it needs to keep running flawlessly.<br\/><\/li><\/ul>",
            "link_url": "",
            "link_text": "",
            "link_style": "link"
          }
        },
        "9ecded98-b69a-4a2b-aad2-a808cdbe7a73": {
          "type": "item",
          "settings": {
            "image": "shopify:\/\/shop_images\/Picture.png",
            "column_size": "2",
            "title": "Crystal Replacement",
            "heading_tag": "h4",
            "content": "<p>Upgrade to a scratch-resistant and durable alternative to mineral glass if your watch crystal frequently gets scratched or cracked.<\/p><ul><li>Upgrade to Scratch-Resistant Durability: If you find that your watch crystal is constantly getting scratched or cracked, consider upgrading to a sapphire crystal. Sapphire crystals are significantly stronger than mineral glass crystals and are virtually scratch-resistant, ensuring long-lasting durability.<\/li><li>Timely Replacement: When you notice scratches, cracks, or other damages to your watch crystal, it is crucial to replace it promptly. Delaying the replacement can lead to further damage and compromise the overall functionality and appearance of your watch. <\/li><li>Expert Installation: Crystal replacement requires the expertise of a skilled professional. Our technicians are trained to carefully handle the replacement process, ensuring a precise fit and proper alignment of the new crystal. We use high-quality materials and follow industry best practices to ensure a successful installation. <\/li><li>Restore Clarity and Aesthetics: By replacing the damaged crystal, you can restore the clarity and visual appeal of your watch. The new crystal will enhance the legibility of the dial and protect it from future scratches, allowing you to enjoy your timepiece with confidence. <\/li><li>Consider Sapphire Crystal: If your watch is prone to scratches, opting for a sapphire crystal is a wise choice. Sapphire crystals offer exceptional clarity, superior scratch resistance, and an elegant appearance, elevating the overall quality and value of your watch.<\/li><li>Custom-Made Crystals For Oddly-Shaped Watches:Most crystals are readily available for replacement when damage occurs, but in the case that the crystals we have available don't fit your particular watch, we can make a custom one just for you.<\/li><\/ul>",
            "link_url": "",
            "link_text": "",
            "link_style": "link"
          }
        },
        "3827dfb3-7f4d-4b20-819f-b59603ccae2d": {
          "type": "item",
          "settings": {
            "image": "shopify:\/\/shop_images\/Picture_1_97a23cd8-381a-4547-9e10-c3a36910af23.png",
            "column_size": "2",
            "title": "Pocket Watches",
            "heading_tag": "h4",
            "content": "<p>Restore and maintain your pocket watch's functionality and appearance. Our services cover repairs, cleaning, lubrication, and adjustment, ensuring accurate timekeeping and preserving the watch's value.<\/p><ul><li>Vintage and Antique Expertise: We specialize in repairing vintage and antique pocket watches, including renowned brands like Waltham, Elgin, Hamilton, Omega, Illinois, Seth Thomas, and more. <\/li><li>Comprehensive Repair Options: Our range of pocket watch repair services covers routine cleanings, complete movement overhauls, and replacements of crystals and crowns. We are dedicated to ensuring that your watch both looks and functions like new. <\/li><li>Swiss-Trained Professional Watchmaker: All pocket watch repairs are performed by our skilled watchmaker, who has received training in Switzerland. With access to state-of-the-art tools and equipment, we deliver meticulous craftsmanship and exceptional quality. <\/li><li>Cleaning and Overhaul Process: When you opt for our cleaning and overhaul service, the following steps are performed: <\/li><li>Disassembly of the case and dialed movement.<\/li><li>Thorough cleaning of the movement using a multi-step ultrasonic cleaning process.<\/li><li>Careful inspection, adjustment, and lubrication of the movement.<\/li><li>Replacement of any worn or damaged movement parts.<\/li><li>Testing of the rate and adjustment if necessary.<\/li><li>Reassembly of the case and dialed movement.<\/li><li>Cleaning and polishing of the watch case.<\/li><li>Quality control testing to ensure proper functioning.<\/li><li>1-Year Warranty: We stand behind our work with a 1-year limited warranty. Our commitment is to deliver reliable repairs and customer satisfaction.<\/li><\/ul>",
            "link_url": "",
            "link_text": "",
            "link_style": "link"
          }
        },
        "34e29e1e-83f0-4d79-a791-ce35fa6f94d9": {
          "type": "item",
          "settings": {
            "image": "shopify:\/\/shop_images\/Picture_1_20a882c5-fd51-4968-8dba-72f90a89a202.png",
            "column_size": "2",
            "title": "Polishing",
            "heading_tag": "h4",
            "content": "<p>Remove scratches, scuffs, and imperfections from the watch's case and bracelet.Whether it's stainless steel, gold, or any other material, experience the makeover.<\/p><ul><li>Our skilled experts know how to make your watch shine. With our professional polish service, we eliminate:<\/li><\/ul><p>&gt; Scratches<\/p><p>&gt; Dents<\/p><p>&gt; General signs of wear<\/p><ul><li> When it comes to handling watches, nobody does it better than our experienced and meticulous team. They utilize top-quality tools and customize the job to suit the unique shape and size of your watch. <\/li><li>By combining the right expertise, tools, and attention to detail, we achieve outstanding results that make your timepiece look as stunning as the day you first wore it. <\/li><\/ul><p><strong>Here's our approach: <\/strong><\/p><ul><li>Utilizing State-of-the-Art Tools: We employ the latest instruments, tools, and techniques to deliver exceptional outcomes.<\/li><li>Polish and Restore the Exterior: We carefully polish and restore the watch's exterior, effectively removing scratches, dents, and imperfections while restoring its luster and shine. <\/li><li>Refinish All Parts: Our comprehensive service extends to refinishing all components of the watch, including the movement, bezel, crystal, and more. We ensure that every aspect of your watch regains its original beauty. <\/li><li>Restore Water Resistance: We meticulously restore your watch to its original water resistance level, guaranteeing its protection against moisture and ensuring its durability.<\/li><\/ul><p><strong>Keep in mind:<\/strong><\/p><ul><li>Deep Scratches may require material removal: If your watch has deep scratches, it may be necessary to remove a small layer of material to achieve the best possible result.<\/li><\/ul>",
            "link_url": "",
            "link_text": "",
            "link_style": "link"
          }
        },
        "7cac5529-fd3b-446a-9008-16c545f0f7eb": {
          "type": "item",
          "settings": {
            "image": "shopify:\/\/shop_images\/Picture_1_6cd9ef58-a2a7-4091-bfde-b000743ebf9b.png",
            "column_size": "2",
            "title": "Rolex Bracelet Restoration",
            "heading_tag": "h4",
            "content": "<p>Purchasing a Rolex offers long-term benefits and the potential for solid investment. Enjoy the satisfaction of owning a timepiece that not only retains its value but also has the potential to become a lucrative investment.<\/p><p>Why Restore Your Bracelet?<\/p><ul><li>Preserve Value: A Rolex that remains in its original configuration from the factory retains its value better. Through our gentle restoration process, we not only save our clients a significant amount of money but also maintain any stamps, numbers, and other important details.<\/li><li>Safeguard Your Investment: Vintage timepieces, especially, have seen a substantial increase in value over the past decades. To protect your investment, restoring the bracelet is a cost-effective way to ensure the preservation of your treasured timepiece. These watches have often been in constant use for multiple decades, and a Rolex in good condition with its original bracelet retains its value more effectively. Additionally, there is immense pleasure in wearing a vintage Rolex in mint condition.<\/li><\/ul>",
            "link_url": "",
            "link_text": "",
            "link_style": "link"
          }
        }
      },
      "block_order": [
        "template--19176972124466__40bddd26-22d8-4549-bbe1-7385859f764b-1684752358f624e333-0",
        "template--19176972124466__40bddd26-22d8-4549-bbe1-7385859f764b-1684752358f624e333-1",
        "template--19176972124466__40bddd26-22d8-4549-bbe1-7385859f764b-1684752358f624e333-2",
        "bd14ed58-149e-4374-b8c0-0d85abb24921",
        "9ecded98-b69a-4a2b-aad2-a808cdbe7a73",
        "3827dfb3-7f4d-4b20-819f-b59603ccae2d",
        "34e29e1e-83f0-4d79-a791-ce35fa6f94d9",
        "7cac5529-fd3b-446a-9008-16c545f0f7eb"
      ],
      "settings": {
        "full_width": true,
        "stack_on_mobile": true,
        "gap": "large",
        "text_alignment": "start",
        "subheading": "",
        "title": "Watches",
        "content": "<p>Organize content into multiple columns to share useful information to your customers about your products, values...<\/p>",
        "background": "#ffffff",
        "background_gradient": "",
        "text_color": ""
      }
    },
    "78f5f6fe-eab7-4d56-8da0-585f9969206c": {
      "type": "media-with-text",
      "disabled": true,
      "blocks": {
        "template--19176972124466__78f5f6fe-eab7-4d56-8da0-585f9969206c-168664516943e5945b-0": {
          "type": "image",
          "settings": {
            "media_width": 50,
            "media_position": "start",
            "text_position": "place-self-center text-center",
            "icon": "none",
            "icon_width": 48,
            "subheading": "",
            "title": "Heading",
            "content": "<p>Use this text to share information about your brand with your customers. Describe a product, share announcements, or welcome customers to your store.<\/p>",
            "link_text": "",
            "link_url": "",
            "background": "#000000",
            "background_gradient": "",
            "text_color": "#ffffff",
            "text_gradient": "",
            "button_background": "",
            "button_text_color": ""
          }
        }
      },
      "block_order": [
        "template--19176972124466__78f5f6fe-eab7-4d56-8da0-585f9969206c-168664516943e5945b-0"
      ],
      "settings": {
        "full_width": false,
        "spacing": "small"
      }
    },
    "6727f992-d7d9-4be9-8274-a77cc40d46f3": {
      "type": "media-with-popup-text",
      "blocks": {
        "template--19505438622002__6727f992-d7d9-4be9-8274-a77cc40d46f3-16868536703386b429-0": {
          "type": "image",
          "settings": {
            "media_width": 50,
            "media_position": "start",
            "text_position": "place-self-center text-center",
            "icon": "none",
            "icon_width": 48,
            "subheading": "",
            "title": "Heading",
            "content": "<p>Use this text to share information about your brand with your customers. Describe a product, share announcements, or welcome customers to your store.<\/p>",
            "popupcontent": "<p>adasfs Use this text to share information about your brand with your customers. Describe a product, share announcements, or welcome customers to your store.<\/p>",
            "link_text": "",
            "link_url": "",
            "background": "#000000",
            "background_gradient": "",
            "text_color": "#ffffff",
            "text_gradient": "",
            "button_background": "",
            "button_text_color": ""
          }
        },
        "8017e307-f81b-4bbc-9d86-7d2dd28d66f2": {
          "type": "image",
          "settings": {
            "media_width": 50,
            "media_position": "start",
            "text_position": "place-self-center text-center",
            "icon": "none",
            "icon_width": 48,
            "subheading": "",
            "title": "Heading",
            "content": "<p>Use this text to share information about your brand with your customers. Describe a product, share announcements, or welcome customers to your store.<\/p>",
            "popupcontent": "<p>22222Use this text to share information about your brand with your customers. Describe a product, share announcements, or welcome customers to your store.<\/p>",
            "link_text": "",
            "link_url": "",
            "background": "#000000",
            "background_gradient": "",
            "text_color": "#ffffff",
            "text_gradient": "",
            "button_background": "",
            "button_text_color": ""
          }
        }
      },
      "block_order": [
        "template--19505438622002__6727f992-d7d9-4be9-8274-a77cc40d46f3-16868536703386b429-0",
        "8017e307-f81b-4bbc-9d86-7d2dd28d66f2"
      ],
      "settings": {
        "full_width": false,
        "spacing": "small"
      }
    }
  },
  "order": [
    "main",
    "40bddd26-22d8-4549-bbe1-7385859f764b",
    "78f5f6fe-eab7-4d56-8da0-585f9969206c",
    "6727f992-d7d9-4be9-8274-a77cc40d46f3"
  ]
}
